airFoil2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6.0
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    airfoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          340;
        startFace       50670;
    }
    farBoundaries
    {
        type            patch;
        nFaces          440;
        startFace       51010;
    }
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       51450;
    }
    outlet
    {
        type            patch;
        nFaces          80;
        startFace       51650;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          51200;
        startFace       51730;
    }
)

// ************************************************************************* //
