airFoil2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           | Copyright (C) 2018 Ehsan Madadi-Kandjani        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format    ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //











// Returns a zero array


// Returns a zero array with commas in the middle of it


// Returns a linear  array with commas (initial point, last point, number of segments, c)

  
// Returns a y_t with commas (arrayX, number of segments, t, c)


// Returns a y_c with commas (arrayX, number of segments, m, p, c)


// Returns a theta with commas (arrayX, number of segments, m, p, c)

      
// Returns a xu with commas (arrayX, arrayYt, arrayTheta, number of segments)


// Returns a yu with commas (arrayYc, arrayYt, arrayTheta, number of segments)

      
// Returns a xl with commas (arrayX, arrayYt, arrayTheta, number of segments)


// Returns a yl with commas (arrayYc, arrayYt, arrayTheta, number of segments)

      
// Include angle of attack (arrayXu, arrayYu, alpha, number of segments)

      

      
// Include angle of attack (arrayXl, arrayYl, alpha, number of segments)

      

      
// Xu with comma to obtain Cmax (arrayXu, arrayYu, alpha, number of segments)



      
// Include angle of attack (arrayXl, arrayYl, alpha, number of segments)

      

      
// Returns the index of maximum array (Yc, Yt, p, number of segments)

      

      


      
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

//NACA airfoil geometry

//Chord length


//Angle of attack (in radian)


//NACA digits





//Mesh

//Height of mesh in y direction


//Length of downstream


//Foil depth in z direction perpendicular to x-y surface


//Scale factor (the mesh is normalized to have chord length equal to one)


//Number of cells and points at each direction and element

//Number of cells in y direction


//Number of cells in downstream


//Number of cells in z direction


//Number of meshes on the front part of airfoil edges p8-p9 and p8-p10b


//Number of meshes on the back part of airfoil edges p9-p11 and p10-p11


//Number of interpolation points along the airfoil for defining the splines


//Cell expansion ratios

//Expansion ratio in y direction


//Expansion ratio in downstream side


//Expansion ratio in inlet


// Base z


// Depth of airfoil


// Front z


// m,p, and t values for the airfoil




// Calculate x array


// Calculate yt array


// Calculate camber


// Calculate theta


// Calculate upper surface x components


// Calculate upper surface y components


// Calculate lower surface x components


// Calculate lower surface y components







// define Cmax


// Move the airfoil





























//Define the points for the inlet arc allocation


















// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
    (-7.25218139039581 2.24336259279374 0) // Vertex p00b = 0 
    (0.374550454016623 -8 0) // Vertex p01b = 1 
    (0.955864666885585 -8 0) // Vertex p02b = 2 
    (16.0 -8 0) // Vertex p03b = 3 
    (16.0 -0.296664159568525 0) // Vertex p04b = 4 
    (16.0 8.0 0) // Vertex p05b = 5 
    (0.955864666885585 8.0 0) // Vertex p06b = 6 
    (0.408767514958483 8.0 0) // Vertex p07b = 7 
    (0 0 0) // Vertex p08b = 8 
    (0.408767514958483 -0.0237422141505193 0) // Vertex p09b = 9 
    (0.374550454016623 -0.13482932352722 0) // Vertex p10b = 10 
    (0.955864666885585 -0.296664159568525 0) // Vertex p11b = 11 
    
    (-7.25218139039581 2.24336259279374 0.01) // Vertex p00t = 12 
    (0.374550454016623 -8 0.01) // Vertex p01t = 13 
    (0.955864666885585 -8 0.01) // Vertex p02t = 14 
    (16.0 -8 0.01) // Vertex p03t = 15 
    (16.0 -0.296664159568525 0.01) // Vertex p04t = 16 
    (16.0 8.0 0.01) // Vertex p05t = 17 
    (0.955864666885585 8.0 0.01) // Vertex p06t = 18 
    (0.408767514958483 8.0 0.01) // Vertex p07t = 19 
    (0 0 0.01) // Vertex p08t = 20 
    (0.408767514958483 -0.0237422141505193 0.01) // Vertex p09t = 21 
    (0.374550454016623 -0.13482932352722 0.01) // Vertex p10t = 22 
    (0.955864666885585 -0.296664159568525 0.01) // Vertex p11t = 23 
);

blocks
(
    //B0
    hex (0 1 10 8 12 13 22 20)
    square
    (100 40 1)
    simpleGrading (1 1 1)
    
    //B1
    hex (1 2 11 10 13 14 23 22)
    square
    (70 40 1)
    simpleGrading (1 1 1)
    
    //B2
    hex (2 3 4 11 14 15 16 23)
    square
    (150 40 1)
    simpleGrading (1 1 1)
    
    //B3
    hex (11 4 5 6 23 16 17 18)
    square
    (150 40 1)
    simpleGrading (1 1 1)
    
    //B4
    hex (9 11 6 7 21 23 18 19)
    square
    (70 40 1)
    simpleGrading (1 1 1)
    
    //B5
    hex (8 9 7 0 20 21 19 12)
    square
    (100 40 1)
    simpleGrading (1 1 1)
);

edges
(
    //Inlet arc
    arc 0 7 (-5.2480867345339 5.65685424949238 0)
    arc 0 1 (-5.2480867345339 -5.65685424949238 0)

    arc 12 19 (-5.2480867345339 5.65685424949238 0.01)
    arc 12 13 (-5.2480867345339 -5.65685424949238 0.01)
    
    //Airfoil surface spline
    spline 8 10 
             (( -3.25169750650399e-05 -0.00281882855018245 0 ) ( 0.000447351161703841 -0.00565148673530256 0 ) ( 0.0014368280179139 -0.00849710799393331 0 ) ( 0.00293260671196899 -0.0113548611409065 0 ) ( 0.00493085828365451 -0.0142239532896611 0 ) ( 0.00742724163299406 -0.0171036345933104 0 ) ( 0.0104169149038254 -0.0199932046982134 0 ) ( 0.0138945482054193 -0.0228920207712106 0 ) ( 0.0178543375444227 -0.0257995069311026 0 ) ( 0.022290019820852 -0.0287151648867745 0 ) ( 0.0271948887261915 -0.0316385855590127 0 ) ( 0.0325618113691601 -0.0345694614408438 0 ) ( 0.0383832454456731 -0.0375075994324791 0 ) ( 0.0446512567641158 -0.0404529338719381 0 ) ( 0.0513575369353869 -0.0434055394713992 0 ) ( 0.058493421039299 -0.0463656438624615 0 ) ( 0.0660499050848012 -0.0493336394509626 0 ) ( 0.0740176630910017 -0.0523100942838593 0 ) ( 0.0823870636289289 -0.0552957616370017 0 ) ( 0.0911481856801024 -0.0582915880433927 0 ) ( 0.100290833686975 -0.0612987194966568 0 ) ( 0.109804551691728 -0.0643185055838312 0 ) ( 0.119678636483341 -0.0673525013250276 0 ) ( 0.129902149697738 -0.0704024665247755 0 ) ( 0.140463928841732 -0.0734703624706369 0 ) ( 0.151352597237645 -0.0765583458485914 0 ) ( 0.162556572911615 -0.0796687597813649 0 ) ( 0.174064076473743 -0.0828041219347875 0 ) ( 0.185863138062216 -0.0859671096779462 0 ) ( 0.197941603445401 -0.0891605423247471 0 ) ( 0.21028713939552 -0.0923873605269592 0 ) ( 0.2228872384641 -0.0956506029312104 0 ) ( 0.235729223302793 -0.0989533802541496 0 ) ( 0.248800250682906 -0.102298846970363 0 ) ( 0.262087315372877 -0.105690170846031 0 ) ( 0.275577254034973 -0.109130500587092 0 ) ( 0.289256749300311 -0.112622931903139 0 ) ( 0.303112334175425 -0.116170472317032 0 ) ( 0.317130396923756 -0.119776005074454 0 ) ( 0.331297186552183 -0.123442252527219 0 ) ( 0.345598819016321 -0.12717173937842 0 ) ( 0.360021284239196 -0.13096675618635 0 ))
         
      
    spline 10 11 
...
         
      
    spline 8 9 
             (( 0.00054323542375729 0.00276621066903902 0 ) ( 0.00159489609079434 0.00544070518269315 0 ) ( 0.00315587984972814 0.00802168866931255 0 ) ( 0.00522636628306832 0.0105067886652998 0 ) ( 0.00780581369726532 0.0128930668685507 0 ) ( 0.0108929567244163 0.0151770361895245 0 ) ( 0.0144858045989503 0.0173546829404605 0 ) ( 0.0185816401900711 0.0194214939557988 0 ) ( 0.023177019886218 0.0213724883917048 0 ) ( 0.0282677744408963 0.0232022539102057 0 ) ( 0.0338490108995782 0.0249049869142565 0 ) ( 0.0399151157346846 0.0264745364644635 0 ) ( 0.0464597593196837 0.0279044514765777 0 ) ( 0.0534759018739229 0.0291880307715605 0 ) ( 0.0609558010068412 0.0303183755273011 0 ) ( 0.0688910209836687 0.0312884436631711 0 ) ( 0.0772724438246624 0.0320911056757335 0 ) ( 0.0860902823364765 0.0327192014362095 0 ) ( 0.0953340951576351 0.0331655974578348 0 ) ( 0.104992803880531 0.0334232441440333 0 ) ( 0.115054712290264 0.0334852325363581 0 ) ( 0.125507527736389 0.0333448500943146 0 ) ( 0.136338384627652 0.0329956350573025 0 ) ( 0.147533870012724 0.0324314289618041 0 ) ( 0.159080051182099 0.031646426914295 0 ) ( 0.170962505198571 0.0306352252518156 0 ) ( 0.183166350236342 0.0293928662573325 0 ) ( 0.195676278582714 0.0279148796354427 0 ) ( 0.208476591131773 0.0261973204951461 0 ) ( 0.221551233177257 0.0242368036297564 0 ) ( 0.234883831292365 0.022030533928923 0 ) ( 0.24845773106796 0.0195763328035929 0 ) ( 0.262256035467977 0.0168726605508652 0 ) ( 0.27626164355213 0.0139186346314149 0 ) ( 0.290457289311418 0.010714043876816 0 ) ( 0.304825580361606 0.00725935868702111 0 ) ( 0.319349036243889 0.00355573731877318 0 ) ( 0.334010126090132 -0.000394971596718613 0 ) ( 0.348791305422405 -0.00459023013452317 0 ) ( 0.363675051872559 -0.00902681555289332 0 ) ( 0.378643899627029 -0.0137008279386133 0 ) ( 0.393680472424461 -0.0186077007724142 0 ))
         
      
    spline 9 11 
...
         
      
    
    spline 20 22 
...
         
      
    spline 22 23 
...
         
      
    spline 20 21 
             (( 0.00054323542375729 0.00276621066903902 0.01 ) ( 0.00159489609079434 0.00544070518269315 0.01 ) ( 0.00315587984972814 0.00802168866931255 0.01 ) ( 0.00522636628306832 0.0105067886652998 0.01 ) ( 0.00780581369726532 0.0128930668685507 0.01 ) ( 0.0108929567244163 0.0151770361895245 0.01 ) ( 0.0144858045989503 0.0173546829404605 0.01 ) ( 0.0185816401900711 0.0194214939557988 0.01 ) ( 0.023177019886218 0.0213724883917048 0.01 ) ( 0.0282677744408963 0.0232022539102057 0.01 ) ( 0.0338490108995782 0.0249049869142565 0.01 ) ( 0.0399151157346846 0.0264745364644635 0.01 ) ( 0.0464597593196837 0.0279044514765777 0.01 ) ( 0.0534759018739229 0.0291880307715605 0.01 ) ( 0.0609558010068412 0.0303183755273011 0.01 ) ( 0.0688910209836687 0.0312884436631711 0.01 ) ( 0.0772724438246624 0.0320911056757335 0.01 ) ( 0.0860902823364765 0.0327192014362095 0.01 ) ( 0.0953340951576351 0.0331655974578348 0.01 ) ( 0.104992803880531 0.0334232441440333 0.01 ) ( 0.115054712290264 0.0334852325363581 0.01 ) ( 0.125507527736389 0.0333448500943146 0.01 ) ( 0.136338384627652 0.0329956350573025 0.01 ) ( 0.147533870012724 0.0324314289618041 0.01 ) ( 0.159080051182099 0.031646426914295 0.01 ) ( 0.170962505198571 0.0306352252518156 0.01 ) ( 0.183166350236342 0.0293928662573325 0.01 ) ( 0.195676278582714 0.0279148796354427 0.01 ) ( 0.208476591131773 0.0261973204951461 0.01 ) ( 0.221551233177257 0.0242368036297564 0.01 ) ( 0.234883831292365 0.022030533928923 0.01 ) ( 0.24845773106796 0.0195763328035929 0.01 ) ( 0.262256035467977 0.0168726605508652 0.01 ) ( 0.27626164355213 0.0139186346314149 0.01 ) ( 0.290457289311418 0.010714043876816 0.01 ) ( 0.304825580361606 0.00725935868702111 0.01 ) ( 0.319349036243889 0.00355573731877318 0.01 ) ( 0.334010126090132 -0.000394971596718613 0.01 ) ( 0.348791305422405 -0.00459023013452317 0.01 ) ( 0.363675051872559 -0.00902681555289332 0.01 ) ( 0.378643899627029 -0.0137008279386133 0.01 ) ( 0.393680472424461 -0.0186077007724142 0.01 ))
         
      
    spline 21 23 
...
         
      
    
);

patches
(
    wall airfoil
    (
        (8 10 22 20)
        (10 11 23 22)
        (8 9 21 20)
        (9 11 23 21)
    )
    
    patch farBoundaries
    (
        (6 7 19 18)
        (5 6 18 17)
        (2 3 15 14)
        (1 2 14 13)
    )
    
    patch inlet
    (
        (7 0 12 19)
        (0 1 13 12)
    )
    
    patch outlet
    (
        (4 5 17 16)
        (3 4 16 15)
    )
);

mergePatchPairs
(
);
